public/queztaz/pinebook-pro/pinebook-pro-troubleshooting-common-issues/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  <link rel="icon" href="/favicon.ico" type="image/x-icon"/>
  
  
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  
  <title>Queztaz/Pinebook Pro Troubleshooting Common Issues</title>
  <h1>Pinebook Pro Troubleshooting Common Issues</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Pinebook Pro Troubleshooting Common Issues</a>
<ul>
<li><a href="#headline-2">Preamble</a>
</li>
</ul>
</li>
<li><a href="#headline-3">Break/Fix</a>
<ul>
<li><a href="#headline-4">Powerkey shuts off machine</a>
</li>
<li><a href="#headline-5">Can&#39;t boot at all after flashing EMMC</a>
</li>
<li><a href="#headline-6">Removing the bootloader</a>
</li>
<li><a href="#headline-7">Loose screws that fall out</a>
</li>
<li><a href="#headline-8">Blinking red light and not booting</a>
</li>
<li><a href="#headline-9">Damaged thermal pad. Getting a replacement.</a>
</li>
</ul>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Pinebook Pro Troubleshooting Common Issues
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Preamble
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>A list of issues I&#39;ve experienced first hand with the Pinebook Pro and
resolutions.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Break/Fix
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Powerkey shuts off machine
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>The powerkey is not in the most ideal locations. Edit /etc/systemd/logind.conf
and change &#34;HandlePowerKey=poweroff&#34; to &#34;HandlePowerKey=ignore&#34;</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Can&#39;t boot at all after flashing EMMC
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>You could either use an emmc to usb adapter to reflash your EMMC (LAME).  You
could use your official pine64 UART cable to see if you could fix the problem
that way (EH).  The third option is that you carefully remove the pinebooks back
plate with the display opened.  It&#39;s important to open the display before
removing the back panel to prevent the flimsy plastic or chassis from cracking
(yup, that could happen).  Once opened, flip the emmc switch to disable the emmc
(<a href="https://wiki.pine64.org/wiki/Pinebook_Pro#Key_Internal_Parts">reference</a>).  With the laptop still open, begin the booting from your microsd.
Once you see the LED turn green, quickly flip the switch to turn on the emmc
again.  Since the EMMC is not present, the pinebook first boots from the
micro-sd.  Our goal is to turn on the EMMC early on in the kernel&#39;s boot up
phase, so this way the emmc gets recognized.  If you flip the switch to late,
the EMMC will not appear as a drive.  Once booted, you could either reflash a
new pinebook image or remove the bootloader from the emmc.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Removing the bootloader
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>Uboot resides within the first 35 or so megabytes of the drive. This is why you
end up seeing free space preceding the boot partition of your drive. Without
this free space, uboot would be overwriting your bootfiles, so it&#39;s important
you add it if you&#39;re ever doing any manual partitioning (i.e installing Gentoo).
I&#39;m including two methods. The first blindly overwrites the beginning of the
drive - potentially damaging the boot partition. The second specifically removes
the parts of the drive containing uboot, keeping your boot parition safe. If you
don&#39;t care about being able to boot from the emmc, use the first method.</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span><span style="color:#75715e"># I forgot how many megabytes of space uboot takes # Method 1</span>
</span></span><span style="display:flex;"><span><span style="color:#f92672">(</span>destructive...maybe<span style="color:#f92672">)</span> dd <span style="color:#66d9ef">if</span><span style="color:#f92672">=</span>/dev/zero of<span style="color:#f92672">=</span>/dev/BLKDEV bs<span style="color:#f92672">=</span>1M count<span style="color:#f92672">=</span><span style="color:#ae81ff">35</span> conv<span style="color:#f92672">=</span>fsync
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e"># Method 2 (non-destructive) dd if=/dev/zero of=/dev/BLKDEV bs=32k seek=1</span>
</span></span><span style="display:flex;"><span>conv<span style="color:#f92672">=</span>fsync &amp;&gt;/dev/null dd <span style="color:#66d9ef">if</span><span style="color:#f92672">=</span>/dev/zero of<span style="color:#f92672">=</span>/dev/BLKDEV bs<span style="color:#f92672">=</span>64k seek<span style="color:#f92672">=</span><span style="color:#ae81ff">128</span> conv<span style="color:#f92672">=</span>fsync
</span></span><span style="display:flex;"><span>&amp;&gt;/dev/null dd <span style="color:#66d9ef">if</span><span style="color:#f92672">=</span>/dev/zero of<span style="color:#f92672">=</span>/dev/BLKDEV bs<span style="color:#f92672">=</span>64k seek<span style="color:#f92672">=</span><span style="color:#ae81ff">192</span> conv<span style="color:#f92672">=</span>fsync
</span></span><span style="display:flex;"><span>&amp;&gt;/dev/null</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Loose screws that fall out
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>Some people reported that their screws to the bottom plate would fall out after
sometime. I&#39;ve never experienced this, but I still took the liberty of
preventing it from happening.  Go to the auto parts section of any store and get
yourself either low strength or medium strength threadlocker. Avoid getting high
strength threadlocker since you obviously still want to be able to easily
unscrew them in the future. Add that to your Pinebook Pro&#39;s screws and you&#39;re
good to go.  I used Permatex Threadlocker Blue (Medium Strength) 24200 which I
bought from Walmart. It works just fine.</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Blinking red light and not booting
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>Pretty sure this is indicative of a kernel panic. Nothing will be displayed on
the screen. The only way to tell what&#39;s going on is to use the UART cable for
the pinebook pro. Buy it if you don&#39;t have it. It&#39;s useful.</p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
Damaged thermal pad. Getting a replacement.
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>Purchase yourself a 4mm thermal pad from Amazon and you&#39;ll be all set.  Cut a 1
inch by 1 inch square.</p>
</div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
